Ran Plan for project: `rancher` dir: `rancher` workspace: `nonprod`

<details><summary>Show Output</summary>

```diff
PLANNING


[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/local versions matching "2.1.0"...
- Finding rancher/rke versions matching "1.3.0"...
- Finding latest version of hashicorp/vault...
- Finding latest version of hashicorp/null...
- Finding hashicorp/aws versions matching "3.70.0"...
- Finding latest version of hashicorp/random...
- Finding hashicorp/helm versions matching "2.4.1"...
- Finding banzaicloud/k8s versions matching "0.9.1"...
- Finding rancher/rancher2 versions matching "1.22.2"...
- Installing hashicorp/vault v3.5.0...
- Installed hashicorp/vault v3.5.0 (signed by HashiCorp)
- Installing hashicorp/null v3.1.1...
- Installed hashicorp/null v3.1.1 (signed by HashiCorp)
- Installing hashicorp/aws v3.70.0...
- Installed hashicorp/aws v3.70.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.4.1...
- Installed hashicorp/helm v2.4.1 (signed by HashiCorp)
- Installing banzaicloud/k8s v0.9.1...
- Installed banzaicloud/k8s v0.9.1 (self-signed, key ID [0m[1m02F889AD8E388232[0m[0m)
- Installing hashicorp/local v2.1.0...
- Installed hashicorp/local v2.1.0 (signed by HashiCorp)
- Installing rancher/rke v1.3.0...
- Installed rancher/rke v1.3.0 (signed by a HashiCorp partner, key ID [0m[1m2EEB0F9AD44A135C[0m[0m)
- Installing hashicorp/random v3.1.3...
- Installed hashicorp/random v3.1.3 (signed by HashiCorp)
- Installing rancher/rancher2 v1.22.2...
- Installed rancher/rancher2 v1.22.2 (signed by a HashiCorp partner, key ID [0m[1m2EEB0F9AD44A135C[0m[0m)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[33m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mMissing backend configuration[0m
[33m│[0m [0m
[33m│[0m [0m[0m-backend-config was used without a "backend" block in the configuration.
[33m│[0m [0m
[33m│[0m [0mIf you intended to override the default local backend configuration,
[33m│[0m [0mno action is required, but you may add an explicit backend block to your
[33m│[0m [0mconfiguration to clear this warning:
[33m│[0m [0m
[33m│[0m [0mterraform {
[33m│[0m [0m  backend "local" {}
[33m│[0m [0m}
[33m│[0m [0m
[33m│[0m [0mHowever, if you intended to override a defined backend, please verify that
[33m│[0m [0mthe backend configuration is present and valid.
[33m│[0m [0m
[33m╵[0m[0m
[0m[0m
[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.rancher_server will be created
+ resource "aws_instance" "rancher_server" {
      + ami                                  = "ami-0d51579f02ac97d77"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = true
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "rancher-sshkey"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = "172.31.10.10"
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-02e8c68a71d98f0eb"
      + tags                                 = {
          + "Creator"     = "Terraform"
          + "Entity"      = "keepcoding"
          + "Environment" = "nonprod"
          + "Name"        = "keepcoding-rancher-server"
          + "Role"        = "Rancher Server"
          + "Team"        = "IAC"
        }
      + tags_all                             = {
          + "Creator"     = "Terraform"
          + "Entity"      = "keepcoding"
          + "Environment" = "nonprod"
          + "Name"        = "keepcoding-rancher-server"
          + "Role"        = "Rancher Server"
          + "Team"        = "IAC"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "5654fd17469b7aa27a0f77419731f192f8ecf767"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (sensitive)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 16
          + volume_type           = "gp2"
        }
    }

  # aws_key_pair.rancher_key_pair will be created
+ resource "aws_key_pair" "rancher_key_pair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "rancher-sshkey"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCscT2uuSeNoOBa5Nh69v6asFXQtqcfJjyed+FU+fM3OVXkuoq0D3l6zjc7ClDTI39f6vzeQ1mV1ZmS9HYIra5K1ioztC/Yrmxa9pWmCSF5RmoHo24IzAK02+IleqBzkTR9MdF0+jYzUR7GCYy5sCvmUG6iOE27waxveNHxCR5zPgYYaPu1Ll6vVD2up0UwuaDA17pIW+0Z8nfASkvjjFQ1caIC2CdXQrsMjuJ7gm2XIKRIwhzVfXJuMyNgB0WCIT7VbRNFmgWa3hGg9+LmZOmkUCBX6l5YsEV4Qi/hVJoJcD21Y9uWsVCpaA70cbX/GX4uLtNxKArARJMwidlDo7ET"
      + tags_all        = (known after apply)
    }

  # aws_security_group.rancher_sg_allowall will be created
+ resource "aws_security_group" "rancher_sg_allowall" {
      + arn                    = (known after apply)
      + description            = "Rancher - Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Calico BGP Port"
              + from_port        = 179
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 179
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Canal/Flannel VXLAN overlay networking"
              + from_port        = 8472
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8472
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Canal/Flannel livenessProbe/readinessProbe"
              + from_port        = 9099
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9099
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Default port required by Monitoring to scrape metrics from Linux node-exporters"
              + from_port        = 9100
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9100
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Default port required by Monitoring to scrape metrics from Windows node-exporters"
              + from_port        = 9796
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9796
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS traffic to Kubernetes API"
              + from_port        = 6443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Ingress controller livenessProbe/readinessProbe"
              + from_port        = 10254
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10254
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Metrics server communication with all nodes API"
              + from_port        = 10250
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10250
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "NAT K8s Ports Temp"
              + from_port        = 30000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 32767
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "NAT K8s Ports Temp"
              + from_port        = 30000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 32767
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "NFS"
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2049
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Node driver Docker daemon TLS port"
              + from_port        = 2376
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2376
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Provide SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Provides HTTP access from client web browsers to the local user interface and connections from Cloud Data Sense"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Provides HTTP access from client web browsers to the local user interface and connections from Cloud Data Sense"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Provides HTTPS access from client web browsers to the local user interface"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Provides ping"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Rancher webhook"
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Rancher webhook"
              + from_port        = 9443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Vault"
              + from_port        = 8500
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8500
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Weave Port"
              + from_port        = 6783
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6784
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "etcd client requests"
              + from_port        = 2379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2379
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "etcd peer communication"
              + from_port        = 2380
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2380
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "iSCSI access through the iSCSI data LIF"
              + from_port        = 3260
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3260
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "sg-xxx (rancher-nodes)"
              + from_port        = 10256
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10256
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "sg-xxx (rancher-nodes)"
              + from_port        = 4789
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 4789
            },
        ]
      + name                   = "sg_nonprod_eu-central-1_rancher_001"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "sg_nonprod_eu-central-1_rancher_001"
          + "Terraform" = "True"
        }
      + tags_all               = {
          + "Name"      = "sg_nonprod_eu-central-1_rancher_001"
          + "Terraform" = "True"
        }
      + vpc_id                 = "vpc-03ae14238ca649e26"
    }

  # local_file.kubeconfig will be created
+ resource "local_file" "kubeconfig" {
      + content              = (sensitive)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./.kube/kube_config.yaml"
      + id                   = (known after apply)
    }

  # null_resource.delay will be created
+ resource "null_resource" "delay" {
      + id = (known after apply)
    }

  # rancher2_bootstrap.admin will be created
+ resource "rancher2_bootstrap" "admin" {
      + current_password   = (sensitive value)
      + id                 = (known after apply)
      + initial_password   = (sensitive value)
      + password           = (sensitive value)
      + telemetry          = false
      + temp_token         = (sensitive value)
      + temp_token_id      = (known after apply)
      + token              = (sensitive value)
      + token_id           = (known after apply)
      + token_ttl          = 0
      + token_update       = false
      + ui_default_landing = "ember"
      + url                = (known after apply)
      + user               = (known after apply)
    }

  # rancher2_cloud_credential.aws-credentials will be created
+ resource "rancher2_cloud_credential" "aws-credentials" {
      + annotations = (known after apply)
      + description = "AWS Credentials Terraform"
      + driver      = (known after apply)
      + id          = (known after apply)
      + labels      = (known after apply)
      + name        = "aws-credentials"

      + amazonec2_credential_config {
          + access_key     = (sensitive value)
          + default_region = "eu-central-1"
          + secret_key     = (sensitive value)
        }
    }

  # rancher2_cluster.rancher-cluster will be created
+ resource "rancher2_cluster" "rancher-cluster" {
      + annotations                             = (known after apply)
      + ca_cert                                 = (sensitive value)
      + cluster_registration_token              = (known after apply)
      + default_pod_security_policy_template_id = (known after apply)
      + default_project_id                      = (known after apply)
      + description                             = "Rancher2 Test Cluster"
      + desired_agent_image                     = (known after apply)
      + desired_auth_image                      = (known after apply)
      + docker_root_dir                         = (known after apply)
      + driver                                  = (known after apply)
      + enable_cluster_alerting                 = (known after apply)
      + enable_cluster_istio                    = (known after apply)
      + enable_cluster_monitoring               = (known after apply)
      + enable_network_policy                   = (known after apply)
      + fleet_workspace_name                    = (known after apply)
      + id                                      = (known after apply)
      + istio_enabled                           = (known after apply)
      + kube_config                             = (sensitive value)
      + labels                                  = (known after apply)
      + name                                    = "rancher-cluster"
      + system_project_id                       = (known after apply)
      + windows_prefered_cluster                = false

      + cluster_auth_endpoint {
          + ca_certs = (known after apply)
          + enabled  = (known after apply)
          + fqdn     = (known after apply)
        }

      + cluster_template_answers {
          + cluster_id = (known after apply)
          + project_id = (known after apply)
          + values     = (known after apply)
        }

      + cluster_template_questions {
          + default  = (known after apply)
          + required = (known after apply)
          + type     = (known after apply)
          + variable = (known after apply)
        }

      + eks_config_v2 {
          + cloud_credential_id   = (known after apply)
          + imported              = (known after apply)
          + kms_key               = (known after apply)
          + kubernetes_version    = (known after apply)
          + logging_types         = (known after apply)
          + name                  = (known after apply)
          + private_access        = (known after apply)
          + public_access         = (known after apply)
          + public_access_sources = (known after apply)
          + region                = (known after apply)
          + secrets_encryption    = (known after apply)
          + security_groups       = (known after apply)
          + service_role          = (known after apply)
          + subnets               = (known after apply)
          + tags                  = (known after apply)

          + node_groups {
              + desired_size           = (known after apply)
              + disk_size              = (known after apply)
              + ec2_ssh_key            = (known after apply)
              + gpu                    = (known after apply)
              + image_id               = (known after apply)
              + instance_type          = (known after apply)
              + labels                 = (known after apply)
              + max_size               = (known after apply)
              + min_size               = (known after apply)
              + name                   = (known after apply)
              + request_spot_instances = (known after apply)
              + resource_tags          = (known after apply)
              + spot_instance_types    = (known after apply)
              + subnets                = (known after apply)
              + tags                   = (known after apply)
              + user_data              = (known after apply)
              + version                = (known after apply)

              + launch_template {
                  + id      = (known after apply)
                  + name    = (known after apply)
                  + version = (known after apply)
                }
            }
        }

      + k3s_config {
          + version = (known after apply)

          + upgrade_strategy {
              + drain_server_nodes = (known after apply)
              + drain_worker_nodes = (known after apply)
              + server_concurrency = (known after apply)
              + worker_concurrency = (known after apply)
            }
        }

      + rke2_config {
          + version = (known after apply)

          + upgrade_strategy {
              + drain_server_nodes = (known after apply)
              + drain_worker_nodes = (known after apply)
              + server_concurrency = (known after apply)
              + worker_concurrency = (known after apply)
            }
        }

      + rke_config {
          + addon_job_timeout     = (known after apply)
          + enable_cri_dockerd    = false
          + ignore_docker_version = true
          + kubernetes_version    = (known after apply)
          + prefix_path           = (known after apply)
          + ssh_agent_auth        = false
          + ssh_cert_path         = (known after apply)
          + ssh_key_path          = (known after apply)
          + win_prefix_path       = (known after apply)

          + authentication {
              + sans     = (known after apply)
              + strategy = (known after apply)
            }

          + authorization {
              + mode    = (known after apply)
              + options = (known after apply)
            }

          + bastion_host {
              + address        = (known after apply)
              + port           = (known after apply)
              + ssh_agent_auth = (known after apply)
              + ssh_key        = (sensitive value)
              + ssh_key_path   = (known after apply)
              + user           = (known after apply)
            }

          + cloud_provider {
              + custom_cloud_provider = (known after apply)
              + name                  = (known after apply)

              + aws_cloud_provider {
                  + global {
                      + disable_security_group_ingress = (known after apply)
                      + disable_strict_zone_check      = (known after apply)
                      + elb_security_group             = (known after apply)
                      + kubernetes_cluster_id          = (known after apply)
                      + kubernetes_cluster_tag         = (known after apply)
                      + role_arn                       = (known after apply)
                      + route_table_id                 = (known after apply)
                      + subnet_id                      = (known after apply)
                      + vpc                            = (known after apply)
                      + zone                           = (known after apply)
                    }

                  + service_override {
                      + region         = (known after apply)
                      + service        = (known after apply)
                      + signing_method = (known after apply)
                      + signing_name   = (known after apply)
                      + signing_region = (known after apply)
                      + url            = (known after apply)
                    }
                }

              + azure_cloud_provider {
                  + aad_client_cert_password         = (sensitive value)
                  + aad_client_cert_path             = (known after apply)
                  + aad_client_id                    = (sensitive value)
                  + aad_client_secret                = (sensitive value)
                  + cloud                            = (known after apply)
                  + cloud_provider_backoff           = (known after apply)
                  + cloud_provider_backoff_duration  = (known after apply)
                  + cloud_provider_backoff_exponent  = (known after apply)
                  + cloud_provider_backoff_jitter    = (known after apply)
                  + cloud_provider_backoff_retries   = (known after apply)
                  + cloud_provider_rate_limit        = (known after apply)
                  + cloud_provider_rate_limit_bucket = (known after apply)
                  + cloud_provider_rate_limit_qps    = (known after apply)
                  + load_balancer_sku                = (known after apply)
                  + location                         = (known after apply)
                  + maximum_load_balancer_rule_count = (known after apply)
                  + primary_availability_set_name    = (known after apply)
                  + primary_scale_set_name           = (known after apply)
                  + resource_group                   = (known after apply)
                  + route_table_name                 = (known after apply)
                  + security_group_name              = (known after apply)
                  + subnet_name                      = (known after apply)
                  + subscription_id                  = (sensitive value)
                  + tenant_id                        = (sensitive value)
                  + use_instance_metadata            = (known after apply)
                  + use_managed_identity_extension   = (known after apply)
                  + vm_type                          = (known after apply)
                  + vnet_name                        = (known after apply)
                  + vnet_resource_group              = (known after apply)
                }

              + openstack_cloud_provider {
                  + block_storage {
                      + bs_version        = (known after apply)
                      + ignore_volume_az  = (known after apply)
                      + trust_device_path = (known after apply)
                    }

                  + global {
                      + auth_url    = (known after apply)
                      + ca_file     = (known after apply)
                      + domain_id   = (sensitive value)
                      + domain_name = (known after apply)
                      + password    = (sensitive value)
                      + region      = (known after apply)
                      + tenant_id   = (sensitive value)
                      + tenant_name = (known after apply)
                      + trust_id    = (sensitive value)
                      + username    = (sensitive value)
                    }

                  + load_balancer {
                      + create_monitor         = (known after apply)
                      + floating_network_id    = (known after apply)
                      + lb_method              = (known after apply)
                      + lb_provider            = (known after apply)
                      + lb_version             = (known after apply)
                      + manage_security_groups = (known after apply)
                      + monitor_delay          = (known after apply)
                      + monitor_max_retries    = (known after apply)
                      + monitor_timeout        = (known after apply)
                      + subnet_id              = (known after apply)
                      + use_octavia            = (known after apply)
                    }

                  + metadata {
                      + request_timeout = (known after apply)
                      + search_order    = (known after apply)
                    }

                  + route {
                      + router_id = (known after apply)
                    }
                }

              + vsphere_cloud_provider {
                  + disk {
                      + scsi_controller_type = (known after apply)
                    }

                  + global {
                      + datacenters          = (known after apply)
                      + insecure_flag        = (known after apply)
                      + password             = (sensitive value)
                      + port                 = (known after apply)
                      + soap_roundtrip_count = (known after apply)
                      + user                 = (sensitive value)
                    }

                  + network {
                      + public_network = (known after apply)
                    }

                  + virtual_center {
                      + datacenters          = (known after apply)
                      + name                 = (known after apply)
                      + password             = (sensitive value)
                      + port                 = (known after apply)
                      + soap_roundtrip_count = (known after apply)
                      + user                 = (sensitive value)
                    }

                  + workspace {
                      + datacenter        = (known after apply)
                      + default_datastore = (known after apply)
                      + folder            = (known after apply)
                      + resourcepool_path = (known after apply)
                      + server            = (known after apply)
                    }
                }
            }

          + dns {
              + node_selector        = (known after apply)
              + options              = (known after apply)
              + provider             = (known after apply)
              + reverse_cidrs        = (known after apply)
              + upstream_nameservers = (known after apply)

              + linear_autoscaler_params {
                  + cores_per_replica            = (known after apply)
                  + max                          = (known after apply)
                  + min                          = (known after apply)
                  + nodes_per_replica            = (known after apply)
                  + prevent_single_point_failure = (known after apply)
                }

              + nodelocal {
                  + ip_address    = (known after apply)
                  + node_selector = (known after apply)
                }

              + tolerations {
                  + effect   = (known after apply)
                  + key      = (known after apply)
                  + operator = (known after apply)
                  + seconds  = (known after apply)
                  + value    = (known after apply)
                }

              + update_strategy {
                  + strategy = (known after apply)

                  + rolling_update {
                      + max_surge       = (known after apply)
                      + max_unavailable = (known after apply)
                    }
                }
            }

          + ingress {
              + default_backend = (known after apply)
              + dns_policy      = (known after apply)
              + extra_args      = (known after apply)
              + http_port       = (known after apply)
              + https_port      = (known after apply)
              + network_mode    = (known after apply)
              + node_selector   = (known after apply)
              + options         = (known after apply)
              + provider        = (known after apply)

              + tolerations {
                  + effect   = (known after apply)
                  + key      = (known after apply)
                  + operator = (known after apply)
                  + seconds  = (known after apply)
                  + value    = (known after apply)
                }

              + update_strategy {
                  + strategy = (known after apply)

                  + rolling_update {
                      + max_unavailable = (known after apply)
                    }
                }
            }

          + monitoring {
              + node_selector = (known after apply)
              + options       = (known after apply)
              + provider      = (known after apply)
              + replicas      = (known after apply)

              + tolerations {
                  + effect   = (known after apply)
                  + key      = (known after apply)
                  + operator = (known after apply)
                  + seconds  = (known after apply)
                  + value    = (known after apply)
                }

              + update_strategy {
                  + strategy = (known after apply)

                  + rolling_update {
                      + max_surge       = (known after apply)
                      + max_unavailable = (known after apply)
                    }
                }
            }

          + network {
              + mtu     = 0
              + options = (known after apply)
              + plugin  = "canal"
            }

          + services {
              + etcd {
                  + ca_cert       = (known after apply)
                  + cert          = (sensitive value)
                  + creation      = (known after apply)
                  + external_urls = (known after apply)
                  + extra_args    = (known after apply)
                  + extra_binds   = (known after apply)
                  + extra_env     = (known after apply)
                  + gid           = (known after apply)
                  + image         = (known after apply)
                  + key           = (sensitive value)
                  + path          = (known after apply)
                  + retention     = (known after apply)
                  + snapshot      = (known after apply)
                  + uid           = (known after apply)

                  + backup_config {
                      + enabled        = (known after apply)
                      + interval_hours = (known after apply)
                      + retention      = (known after apply)
                      + safe_timestamp = (known after apply)
                      + timeout        = (known after apply)

                      + s3_backup_config {
                          + access_key  = (sensitive value)
                          + bucket_name = (known after apply)
                          + custom_ca   = (known after apply)
                          + endpoint    = (known after apply)
                          + folder      = (known after apply)
                          + region      = (known after apply)
                          + secret_key  = (sensitive value)
                        }
                    }
                }

              + kube_api {
                  + admission_configuration  = (known after apply)
                  + always_pull_images       = (known after apply)
                  + extra_args               = (known after apply)
                  + extra_binds              = (known after apply)
                  + extra_env                = (known after apply)
                  + image                    = (known after apply)
                  + pod_security_policy      = (known after apply)
                  + service_cluster_ip_range = (known after apply)
                  + service_node_port_range  = (known after apply)

                  + audit_log {
                      + enabled = (known after apply)

                      + configuration {
                          + format     = (known after apply)
                          + max_age    = (known after apply)
                          + max_backup = (known after apply)
                          + max_size   = (known after apply)
                          + path       = (known after apply)
                          + policy     = (known after apply)
                        }
                    }

                  + event_rate_limit {
                      + configuration = (known after apply)
                      + enabled       = (known after apply)
                    }

                  + secrets_encryption_config {
                      + custom_config = (known after apply)
                      + enabled       = (known after apply)
                    }
                }

              + kube_controller {
                  + cluster_cidr             = (known after apply)
                  + extra_args               = (known after apply)
                  + extra_binds              = (known after apply)
                  + extra_env                = (known after apply)
                  + image                    = (known after apply)
                  + service_cluster_ip_range = (known after apply)
                }

              + kubelet {
                  + cluster_dns_server           = (known after apply)
                  + cluster_domain               = (known after apply)
                  + extra_args                   = (known after apply)
                  + extra_binds                  = (known after apply)
                  + extra_env                    = (known after apply)
                  + fail_swap_on                 = (known after apply)
                  + generate_serving_certificate = (known after apply)
                  + image                        = (known after apply)
                  + infra_container_image        = (known after apply)
                }

              + kubeproxy {
                  + extra_args  = (known after apply)
                  + extra_binds = (known after apply)
                  + extra_env   = (known after apply)
                  + image       = (known after apply)
                }

              + scheduler {
                  + extra_args  = (known after apply)
                  + extra_binds = (known after apply)
                  + extra_env   = (known after apply)
                  + image       = (known after apply)
                }
            }

          + upgrade_strategy {
              + drain                        = (known after apply)
              + max_unavailable_controlplane = (known after apply)
              + max_unavailable_worker       = (known after apply)

              + drain_input {
                  + delete_local_data  = (known after apply)
                  + force              = (known after apply)
                  + grace_period       = (known after apply)
                  + ignore_daemon_sets = (known after apply)
                  + timeout            = (known after apply)
                }
            }
        }

      + scheduled_cluster_scan {
          + enabled = (known after apply)

          + scan_config {
              + cis_scan_config {
                  + debug_master               = (known after apply)
                  + debug_worker               = (known after apply)
                  + override_benchmark_version = (known after apply)
                  + override_skip              = (known after apply)
                  + profile                    = (known after apply)
                }
            }

          + schedule_config {
              + cron_schedule = (known after apply)
              + retention     = (known after apply)
            }
        }
    }

  # rancher2_node_pool.master-zona-a will be created
+ resource "rancher2_node_pool" "master-zona-a" {
      + annotations                 = (known after apply)
      + cluster_id                  = (known after apply)
      + control_plane               = true
      + delete_not_ready_after_secs = 0
      + etcd                        = true
      + hostname_prefix             = "rancher-master-za-0"
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + name                        = "rancher-master-zona-a"
      + node_template_id            = (known after apply)
      + quantity                    = 1
      + worker                      = false
    }

  # rancher2_node_pool.master-zona-b will be created
+ resource "rancher2_node_pool" "master-zona-b" {
      + annotations                 = (known after apply)
      + cluster_id                  = (known after apply)
      + control_plane               = true
      + delete_not_ready_after_secs = 0
      + etcd                        = true
      + hostname_prefix             = "rancher-master-zb-0"
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + name                        = "rancher-master-zona-b"
      + node_template_id            = (known after apply)
      + quantity                    = 1
      + worker                      = false
    }

  # rancher2_node_pool.master-zona-c will be created
+ resource "rancher2_node_pool" "master-zona-c" {
      + annotations                 = (known after apply)
      + cluster_id                  = (known after apply)
      + control_plane               = true
      + delete_not_ready_after_secs = 0
      + etcd                        = true
      + hostname_prefix             = "rancher-master-zc-0"
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + name                        = "rancher-master-zona-c"
      + node_template_id            = (known after apply)
      + quantity                    = 1
      + worker                      = false
    }

  # rancher2_node_pool.worker-zona-a will be created
+ resource "rancher2_node_pool" "worker-zona-a" {
      + annotations                 = (known after apply)
      + cluster_id                  = (known after apply)
      + control_plane               = false
      + delete_not_ready_after_secs = 0
      + etcd                        = false
      + hostname_prefix             = "rancher-worker-za-0"
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + name                        = "rancher-worker-zona-a"
      + node_template_id            = (known after apply)
      + quantity                    = 1
      + worker                      = true
    }

  # rancher2_node_pool.worker-zona-b will be created
+ resource "rancher2_node_pool" "worker-zona-b" {
      + annotations                 = (known after apply)
      + cluster_id                  = (known after apply)
      + control_plane               = false
      + delete_not_ready_after_secs = 0
      + etcd                        = false
      + hostname_prefix             = "rancher-worker-zb-0"
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + name                        = "rancher-worker-zona-b"
      + node_template_id            = (known after apply)
      + quantity                    = 1
      + worker                      = true
    }

  # rancher2_node_pool.worker-zona-c will be created
+ resource "rancher2_node_pool" "worker-zona-c" {
      + annotations                 = (known after apply)
      + cluster_id                  = (known after apply)
      + control_plane               = false
      + delete_not_ready_after_secs = 0
      + etcd                        = false
      + hostname_prefix             = "rancher-worker-zc-0"
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + name                        = "rancher-worker-zona-c"
      + node_template_id            = (known after apply)
      + quantity                    = 1
      + worker                      = true
    }

  # rancher2_node_template.template-t3a-medium-zona-a will be created
+ resource "rancher2_node_template" "template-t3a-medium-zona-a" {
      + annotations             = (known after apply)
      + cloud_credential_id     = (known after apply)
      + description             = "Rancher Node Template t3a.medium zona a"
      + driver                  = (known after apply)
      + driver_id               = (known after apply)
      + engine_install_url      = "https://releases.rancher.com/install-docker/19.03.sh"
      + id                      = (known after apply)
      + labels                  = (known after apply)
      + name                    = "template-t3a-medium-zona-a"
      + use_internal_ip_address = true

      + amazonec2_config {
          + ami                        = "ami-07df0313733462994"
          + block_duration_minutes     = "0"
          + device_name                = "/dev/sda1"
          + encrypt_ebs_volume         = false
          + insecure_transport         = false
          + instance_type              = "t3a.medium"
          + monitoring                 = false
          + private_address_only       = false
          + region                     = "eu-central-1"
          + request_spot_instance      = false
          + retries                    = "5"
          + root_size                  = "16"
          + security_group             = [
              + "sg_nonprod_eu-central-1_rancher_001",
            ]
          + security_group_readonly    = false
          + spot_price                 = "0.50"
          + ssh_user                   = "ubuntu"
          + subnet_id                  = "subnet-02e8c68a71d98f0eb"
          + use_ebs_optimized_instance = false
          + use_private_address        = false
          + volume_type                = "gp2"
          + vpc_id                     = "vpc-03ae14238ca649e26"
          + zone                       = "a"
        }
    }

  # rancher2_node_template.template-t3a-medium-zona-b will be created
+ resource "rancher2_node_template" "template-t3a-medium-zona-b" {
      + annotations             = (known after apply)
      + cloud_credential_id     = (known after apply)
      + description             = "Rancher Node Template t3a.medium zona b"
      + driver                  = (known after apply)
      + driver_id               = (known after apply)
      + engine_install_url      = "https://releases.rancher.com/install-docker/19.03.sh"
      + id                      = (known after apply)
      + labels                  = (known after apply)
      + name                    = "template-t3a-medium-zona-b"
      + use_internal_ip_address = true

      + amazonec2_config {
          + ami                        = "ami-07df0313733462994"
          + block_duration_minutes     = "0"
          + device_name                = "/dev/sda1"
          + encrypt_ebs_volume         = false
          + insecure_transport         = false
          + instance_type              = "t3a.medium"
          + monitoring                 = false
          + private_address_only       = false
          + region                     = "eu-central-1"
          + request_spot_instance      = false
          + retries                    = "5"
          + root_size                  = "16"
          + security_group             = [
              + "sg_nonprod_eu-central-1_rancher_001",
            ]
          + security_group_readonly    = false
          + spot_price                 = "0.50"
          + ssh_user                   = "ubuntu"
          + subnet_id                  = "subnet-02d01cf197d005961"
          + use_ebs_optimized_instance = false
          + use_private_address        = false
          + volume_type                = "gp2"
          + vpc_id                     = "vpc-03ae14238ca649e26"
          + zone                       = "b"
        }
    }

  # rancher2_node_template.template-t3a-medium-zona-c will be created
+ resource "rancher2_node_template" "template-t3a-medium-zona-c" {
      + annotations             = (known after apply)
      + cloud_credential_id     = (known after apply)
      + description             = "Rancher Node Template t3a.medium zona c"
      + driver                  = (known after apply)
      + driver_id               = (known after apply)
      + engine_install_url      = "https://releases.rancher.com/install-docker/19.03.sh"
      + id                      = (known after apply)
      + labels                  = (known after apply)
      + name                    = "template-t3a-medium-zona-c"
      + use_internal_ip_address = true

      + amazonec2_config {
          + ami                        = "ami-07df0313733462994"
          + block_duration_minutes     = "0"
          + device_name                = "/dev/sda1"
          + encrypt_ebs_volume         = false
          + insecure_transport         = false
          + instance_type              = "t3a.medium"
          + monitoring                 = false
          + private_address_only       = false
          + region                     = "eu-central-1"
          + request_spot_instance      = false
          + retries                    = "5"
          + root_size                  = "16"
          + security_group             = [
              + "sg_nonprod_eu-central-1_rancher_001",
            ]
          + security_group_readonly    = false
          + spot_price                 = "0.50"
          + ssh_user                   = "ubuntu"
          + subnet_id                  = "subnet-0a6d1a3a47764fa26"
          + use_ebs_optimized_instance = false
          + use_private_address        = false
          + volume_type                = "gp2"
          + vpc_id                     = "vpc-03ae14238ca649e26"
          + zone                       = "c"
        }
    }

  # random_password.password will be created
+ resource "random_password" "password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ rancher_admin_password = (known after apply)
+ rancher_admin_url      = (known after apply)
+ rancher_public_ip      = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p rancher`
* :put_litter_in_its_place: To **delete** this plan click [here](http://825d47ad9d61:4141/lock?id=jonasmarquez%252Fatlantis-rancher-cluster%252Francher%252Fnonprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p rancher`
</details>
Plan: 18 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
